Homework6 –®–∫–æ–ª–∞ DataScientist, –¥–µ–∫–∞–±—Ä—å 2022, –ê–Ω–¥—Ä–µ–µ–≤–∞ –û–ª—å–≥–∞

In [1]:
import sqlite3
import pandas as pd

In [2]:
con = sqlite3.connect(':memory:')

In [3]:
table_names = [
    'Categories',   # –∫–∞—Ç–µ–≥–æ—Ä–∏–∏ —Ç–æ–≤–∞—Ä–æ–≤
    'Customers',    # –∑–∞–∫–∞–∑—á–∏–∫–∏
    'Employees',    # —Å–æ—Ç—Ä—É–¥–Ω–∏–∫–∏
    'OrderDetails', # –¥–µ—Ç–∞–ª–∏ –∑–∞–∫–∞–∑–æ–≤
    'Orders',       # –∑–∞–∫–∞–∑—ã
    'Products',     # —Ç–æ–≤–∞—Ä—ã
    'Shippers',     # –ø–µ—Ä–µ–≤–æ–∑—á–∏–∫–∏
    'Suppliers',    # –ø–æ—Å—Ç–∞–≤—â–∏–∫–∏
]

In [4]:
for table in table_names:
    data = pd.read_csv(f'./csv_for_sql/{table}.csv', sep = ';')
    data.to_sql(table, con, index=False, if_exists='replace')

In [25]:
tasks = 0

### –í—Å–µ –∑–∞–¥–∞–Ω–∏—è –Ω—É–∂–Ω–æ –≤—ã–ø–æ–ª–Ω–∏—Ç—å —Ç–æ–ª—å–∫–æ —Å –ø–æ–º–æ—â—å—é sql

1. –í—ã–±–µ—Ä–∏—Ç–µ –∑–∞–∫–∞–∑—á–∏–∫–æ–≤ –∏–∑ –ì–µ—Ä–º–∞–Ω–∏–∏, –§—Ä–∞–Ω—Ü–∏–∏ –∏ –ú–∞–¥—Ä–∏–¥–∞, –≤—ã–≤–µ–¥–∏—Ç–µ –∏—Ö –Ω–∞–∑–≤–∞–Ω–∏–µ, —Å—Ç—Ä–∞–Ω—É –∏ –∞–¥—Ä–µ—Å.

In [26]:
tasks+=1
pd.read_sql(
    '''
    SELECT CustomerName, Country, Address 
    FROM Customers 
    WHERE upper(City) = 'MADRID' or upper(Country) in ('FRANCE','GERMANY')
    ''',
    con,
)

,CustomerName,Country,Address
0,Alfreds Futterkiste,Germany,Obere Str. 57
1,Blauer See Delikatessen,Germany,Forsterstr. 57
2,Blondel p√®re et fils,France,"24, place Kl√©ber"
3,B√≥lido Comidas preparadas,Spain,"C/ Araquil, 67"
4,Bon app',France,"12, rue des Bouchers"
5,Drachenblut Delikatessend,Germany,Walserweg 21
6,Du monde entier,France,"67, rue des Cinquante Otages"
7,FISSA Fabrica Inter. Salchichas S.A.,Spain,"C/ Moralzarzal, 86"
8,Folies gourmandes,France,"184, chauss√©e de Tournai"
9,Frankenversand,Germany,Berliner Platz 43
10,France restauration,France,"54, rue Royale"
11,K√∂niglich Essen,Germany,Maubelstr. 90
12,La corne d'abondance,France,"67, avenue de l'Europe"
13,La maison d'Asie,France,1 rue Alsace-Lorraine
14,Lehmanns Marktstand,Germany,Magazinweg 7
15,Morgenstern Gesundkost,Germany,Heerstr. 22
16,Ottilies K√§seladen,Germany,Mehrheimerstr. 369
17,Paris sp√©cialit√©s,France,"265, boulevard Charonne"
18,QUICK-Stop,Germany,Taucherstra√üe 10
19,Romero y tomillo,Spain,"Gran V√≠a, 1"
20,Sp√©cialit√©s du monde,France,"25, rue Lauriston"
21,Toms Spezialit√§ten,Germany,Luisenstr. 48
22,Victuailles en stock,France,"2, rue du Commerce"
23,Vins et alcools Chevalier,France,59 rue de l'Abbaye
24,Die Wandernde Kuh,Germany,Adenauerallee 900

2. –í—ã–±–µ—Ä–∏—Ç–µ —Ç–æ–ø 3 —Å—Ç—Ä–∞–Ω—ã –ø–æ –∫–æ–ª–∏—á–µ—Å—Ç–≤—É –∑–∞–∫–∞–∑—á–∏–∫–æ–≤, –≤—ã–≤–µ–¥–∏—Ç–µ –∏—Ö –Ω–∞–∑–≤–∞–Ω–∏—è –∏ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –∑–∞–ø–∏—Å–µ–π.

In [27]:
tasks+=1
pd.read_sql(
    '''
    SELECT Country, count(*) as CustomersCount
    FROM Customers 
    group by Country
    order by count(*) desc
    limit 3
    ''',
    con,
)

   Country  CustomersCount
0      USA              13
1  Germany              11
2   France              11

3. –í—ã–±–µ—Ä–∏—Ç–µ –ø–µ—Ä–µ–≤–æ–∑—á–∏–∫–∞, –∫–æ—Ç–æ—Ä—ã–π –æ—Ç–ø—Ä–∞–≤–∏–ª 10-–π –ø–æ –≤—Ä–µ–º–µ–Ω–∏ –∑–∞–∫–∞–∑, –≤—ã–≤–µ–¥–∏—Ç–µ –µ–≥–æ –Ω–∞–∑–≤–∞–Ω–∏–µ, –∏ –¥–∞—Ç—É –æ—Ç–ø—Ä–∞–≤–ª–µ–Ω–∏—è.

In [28]:
tasks+=1
pd.read_sql(
    '''
    SELECT ShipperName, OrderDate 
    FROM Orders o
        left join Shippers s on s.ShipperID=o.ShipperID
    order by OrderDate
    limit 9, 1
    ''',
    con,
)

        ShipperName   OrderDate
0  Federal Shipping  02.10.1996

4. –í—ã–±–µ—Ä–∏—Ç–µ —Å–∞–º—ã–π –¥–æ—Ä–æ–≥–æ–π –∑–∞–∫–∞–∑, –≤—ã–≤–µ–¥–∏—Ç–µ —Å–ø–∏—Å–æ–∫ —Ç–æ–≤–∞—Ä–æ–≤ —Å –∏—Ö —Ü–µ–Ω–∞–º–∏.

In [29]:
tasks+=1
pd.read_sql(
    '''
    with OrderIDs as (
       SELECT OrderId, sum(Quantity*Price) as Cost
       FROM OrderDetails od 
           left join Products p on p.ProductID=od.ProductID
       group by OrderID
       order by Cost desc
       limit 1
       )
    select o.OrderId, ProductName, Quantity, Price
    from OrderIDs o 
        join OrderDetails od on od.OrderID=o.OrderID
        left join Products p on p.ProductID=od.ProductID
    ''',
    con,
)

   OrderId             ProductName  Quantity  Price
0    10372  Sir Rodney's Marmalade        12   81.0
1    10372           C√¥te de Blaye        40  263.5
2    10372       Camembert Pierrot        70   34.0
3    10372  Mozzarella di Giovanni        42   34.8

5. –ö–∞–∫–æ–π —Ç–æ–≤–∞—Ä –±–æ–ª—å—à–µ –≤—Å–µ–≥–æ –∑–∞–∫–∞–∑—ã–≤–∞–ª–∏ –ø–æ –∫–æ–ª–∏—á–µ—Å—Ç–≤—É –µ–¥–∏–Ω–∏—Ü —Ç–æ–≤–∞—Ä–∞, –≤—ã–≤–µ–¥–∏—Ç–µ –µ–≥–æ –Ω–∞–∑–≤–∞–Ω–∏–µ –∏ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –µ–¥–∏–Ω–∏—Ü –≤ –∫–∞–∂–¥–æ–º –∏–∑ –∑–∞–∫–∞–∑–æ–≤.

In [30]:
tasks+=1
pd.read_sql(
    '''
    with ProductIDs as (
            select p.ProductID,ProductName
            from OrderDetails od
                join Products p on p.ProductID=od.ProductID
            group by p.ProductID, ProductName
            order by sum(Quantity) desc
            limit 1
            )
    select OrderID, ProductName, Quantity
    from ProductIDs p
        join OrderDetails od on od.ProductID=p.ProductID
    ''',
    con,
)

    OrderID        ProductName  Quantity
0     10253  Gorgonzola Telino        20
1     10272  Gorgonzola Telino        40
2     10273  Gorgonzola Telino        15
3     10325  Gorgonzola Telino         4
4     10335  Gorgonzola Telino        25
5     10342  Gorgonzola Telino        56
6     10356  Gorgonzola Telino        30
7     10359  Gorgonzola Telino        70
8     10363  Gorgonzola Telino        20
9     10374  Gorgonzola Telino        30
10    10376  Gorgonzola Telino        42
11    10390  Gorgonzola Telino        60
12    10393  Gorgonzola Telino        32
13    10423  Gorgonzola Telino        14

6. –í—ã–≤–µ–¥–∏—Ç–µ —Ç–æ–ø 5 –ø–æ—Å—Ç–∞–≤—â–∏–∫–æ–≤ –ø–æ –∫–æ–ª–∏—á–µ—Å—Ç–≤—É –∑–∞–∫–∞–∑–æ–≤, –≤—ã–≤–µ–¥–∏—Ç–µ –∏—Ö –Ω–∞–∑–≤–∞–Ω–∏—è, —Å—Ç—Ä–∞–Ω—É, –∫–æ–Ω—Ç–∞–∫—Ç–Ω–æ–µ –ª–∏—Ü–æ –∏ —Ç–µ–ª–µ—Ñ–æ–Ω.

In [31]:
tasks+=1
pd.read_sql(
    '''
    SELECT SupplierName, Country, ContactName, Phone, count(*) as OrdersCount
    FROM (
        Select distinct OrderID, s.SupplierID, SupplierName, Country, ContactName, Phone
        from Suppliers s
            join Products p on p.SupplierID=s.SupplierID
            join OrderDetails od on od.ProductId=p.ProductId) os
    group by SupplierID, SupplierName, Country, ContactName, Phone
    order by count(*) desc
    limit 5
    ''',
    con,
)

,SupplierName,Country,ContactName,Phone,OrdersCount
0,"Pavlova, Ltd.",Australia,Ian Devling,(03) 444-2343,37
1,Plutzer Lebensmittelgro√üm√§rkte AG,Germany,Martin Bein,(069) 992755,37
2,"Specialty Biscuits, Ltd.",UK,Peter Wilson,(161) 555-4448,33
3,Norske Meierier,Norway,Beate Vileid,(0)2-953010,30
4,Formaggi Fortini s.r.l.,Italy,Elio Rossi,(0544) 60323,27

7. –ö–∞–∫—É—é –∫–∞—Ç–µ–≥–æ—Ä–∏—é —Ç–æ–≤–∞—Ä–æ–≤ –∑–∞–∫–∞–∑—ã–≤–∞–ª–∏ –±–æ–ª—å—à–µ –≤—Å–µ–≥–æ –ø–æ —Å—Ç–æ–∏–º–æ—Å—Ç–∏ –≤ –ë—Ä–∞–∑–∏–ª–∏–∏, –≤—ã–≤–µ–¥–∏—Ç–µ —Å—Ç—Ä–∞–Ω—É, –Ω–∞–∑–≤–∞–Ω–∏–µ –∫–∞—Ç–µ–≥–æ—Ä–∏–∏ –∏ —Å—É–º–º—É.

In [32]:
tasks+=1
pd.read_sql(
    '''
    select  c.Country, ctg.CategoryName, sum(od.Quantity*p.Price) as Cost
    from Orders o 
        join OrderDetails od on od.OrderID = o.OrderID 
        join Products p on p.ProductId= od.ProductId
        left join Categories ctg on ctg.CategoryID=p.CategoryID
        join Customers c on c.CustomerID=o.CustomerID
    where upper(c.Country)='BRAZIL'
    group by p.CategoryID, ctg.CategoryName, c.Country
    order by Cost desc
    limit 1
    ''',
    con,
)

  Country CategoryName      Cost
0  Brazil    Beverages  13683.25

8. –ö–∞–∫–∞—è —Ä–∞–∑–Ω–∏—Ü–∞ –≤ —Å—Ç–æ–∏–º–æ—Å—Ç–∏ –º–µ–∂–¥—É —Å–∞–º—ã–º –¥–æ—Ä–æ–≥–∏–º –∏ —Å–∞–º—ã–º –¥–µ—à–µ–≤—ã–º –∑–∞–∫–∞–∑–æ–º –∏–∑ –°–®–ê.

In [33]:
tasks+=1
pd.read_sql(
    '''
    with OrdersCost as (
               SELECT sum(Quantity*Price) as Cost
           FROM Orders o
               join OrderDetails od on od.OrderId = o.OrderId
               left join Products p on p.ProductID = od.ProductID
               join Customers c on c.CustomerID = o.CustomerID
           where upper(c.Country) = 'USA'    
           group by o.OrderId, c.CustomerID)
       
    select max(Cost) - min(Cost) as CostDifference from OrdersCost 
    ''',
    con,
)

   CostDifference
0         7649.25

9. –í—ã–≤–µ–¥–∏—Ç–µ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –∑–∞–∫–∞–∑–æ–≤ —É –∫–∞–∂–¥–æ–≥–æ –∏—Ö —Ç—Ä–µ—Ö —Å–∞–º—ã—Ö –º–æ–ª–æ–¥—ã—Ö —Å–æ—Ç—Ä—É–¥–Ω–∏–∫–æ–≤, –∞ —Ç–∞–∫–∂–µ –∏–º—è –∏ —Ñ–∞–º–∏–ª–∏—é –≤–æ –≤—Ç–æ—Ä–æ–π –∫–æ–ª–æ–Ω–∫–µ.

In [34]:
tasks+=1
pd.read_sql(
    '''
    select DATE(substr(BirthDate,7,4)||'-'||substr(BirthDate,4,2)||'-'||substr(BirthDate,1,2)) as BDFormated
         , e.LastName||' '||e.FirstName  as FullName  
         , count(*) as OrdersCount
    from Employees e
        left join Orders o on o.EmployeeID=e.EmployeeID
    group by e.EmployeeID, e.LastName, e.FirstName, BDFormated
    order by BDFormated desc
    limit 3
    ''',
    con,
)

   BDFormated         FullName  OrdersCount
0  1969-07-02   Dodsworth Anne            6
1  1968-12-08    Davolio Nancy           29
2  1963-08-30  Leverling Janet           31

10. –°–∫–æ–ª—å–∫–æ –±–∞–Ω–æ–∫ –∫—Ä–∞–±–æ–≤–æ–≥–æ –º—è—Å–∞ –≤—Å–µ–≥–æ –±—ã–ª–æ –∑–∞–∫–∞–∑–∞–Ω–æ.

In [35]:
tasks+=1
pd.read_sql(
    '''
    select sum(od.Quantity * CAST(substr(Unit, 1, instr(Unit, ' '))as integer)) as AllTinsCount
    from Products p
        join OrderDetails od on od.ProductId=p.ProductId
    where upper(ProductName) like '%CRAB_MEAT%'
    ''',
    con,
)

   AllTinsCount
0          6144

In [36]:
if tasks==10:
    print('–í—ã–ø–æ–ª–Ω–µ–Ω—ã –≤—Å–µ –∑–∞–¥–∞–Ω–∏—è üôÇ')
else:
    print('–í—ã–ø–æ–ª–Ω–µ–Ω—ã –Ω–µ –≤—Å–µ –∑–∞–¥–∞–Ω–∏—è! üôÄ')

–í—ã–ø–æ–ª–Ω–µ–Ω—ã –≤—Å–µ –∑–∞–¥–∞–Ω–∏—è üôÇ